#coding: utf-8
#Задача № 2
a = int(input('Введите число : '))
if a % 2 = = 0:
    print('Четное')
else:
    print('Нечетное')
  
#Задача № 3    
x = int(input("Введите число: "))
if (x // 1000) + (x % 10) = = (x % 1000 / / 100) - (x % 100 / / 10):
    print('ДА')
else:
    print('НЕТ')

#Задача № 4
y = int(input("Введите возраст: ")) 

if y >= 18: 
 
    print("Доступ разрешён ")  
 
else: 
    print("Доступ запрещён")
    
#Задача № 5
z = int(input("Введите первое число: "))
b = int(input(" Введите второе число: "))
c = int(input("Введите третье число: "))
if b - z == c - b:
print('YES')
else:
print('NO')
