#coding: utf-8
#Задача № 1
a = int (input ("Введите первое число: "))
b = int (input ("Введите второе число: "))
c = int(input("Сумма этих чисел: ")) 
if a + b = = c: 
    print("YES") 
else: 
    print("NO")

#Задача № 2
mport random
X = random.randint(1,10)
otvet = int(input("Твой отец загадал число.\nУгадай его: ")
if otvet == a:
    print("Угадал!")
else:
    print("Не угадал.")
Конец игры

#Задача № 3
y = int (input ("Введите число: "))
y = 1
if y = = 1:
    print("Пошёл дождь. Возьмите зонтик!")
else:
    print("Нет дождя.")
    
#Задача № 4
r = int(input('Введите кол-во баллов по русскому языку: '))
m = int(input('Введите кол-во баллов по математики: '))
i = int(input('Введите кол-во баллов по информатики: '))
if r + m + i >= 270:
    print('Поздравляю, ты поступил на бюджет!')
else:
    print('К сожалению, ты не прошёл на бюджет.')
    
#Задача № 5
z = int(input("Введите число: "))
if z%2==0 :
    print('yes')
Else:
    print('no')

